fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ТЧ_ДоговорРеализация</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаСервере
Функция ЗаполнитьНаСервере()
	
	ДатаНачала = Объект.ВКМ_Период.ДатаНачала;
	ДатаОкончания = Объект.ВКМ_Период.ДатаОкончания;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокНаСервере", ДатаНачала, ДатаОкончания);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	ДлительнаяОперация = ЗаполнитьНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьТаблицу", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
    
    	Возврат; 
    
    КонецЕсли;   
    
    СписокРеализаций = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
    
    УдалитьИзВременногоХранилища(Результат.АдресРезультата);  
   
   ЗаполнитьСписокРеализаций(СписокРеализаций);
   
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокРеализаций(СписокРеализаций)
    
     Объект.ВКМ_ТЧ_ДоговорРеализация.Очистить();
     
     Для каждого Строка Из СписокРеализаций Цикл
     
     	 НоваяСтрока = Объект.ВКМ_ТЧ_ДоговорРеализация.Добавить(); 
         НоваяСтрока.Договор = Строка.Договор; 
         НоваяСтрока.Реализация = Строка.Реализация; 
     
     КонецЦикла;
    

КонецПроцедуры
